app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @categories = Category.all

INSERT INTO "categories" ("name", "created_at", "updated_at", "lft", "rgt") VALUES (?, ?, ?, ?, ?)  [["name", "root"], ["created_at", "2017-11-15 04:54:46.124665"], ["updated_at", "2017-11-15 04:54:46.124665"], ["lft", 1], ["rgt", 2]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
---
  def destroy
    @category.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_category
      begin
          @category = Category.find(params[:id])